app/controllers/items_controller.rb

  def create
  	@item = Item.new(item_params)
  	if @item.save
---
INSERT INTO "items" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test Item"], ["created_at", "2017-10-04 18:37:27.957427"], ["updated_at", "2017-10-04 18:37:27.957427"]]

  def update
    @item = Item.find(params[:id])

    if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "items" SET "name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Test Item 2"], ["updated_at", "2017-10-04 19:22:13.836920"], ["id", 4]]